# Завдання
# Створіть консольну програму «Помічник користувача», яка містить меню з трьох пунктів і об’єднує всі теми, вивчені на попередніх заняттях.
# При запуску програма має виводити:
# === Помічник користувача ===
# Перевірити пароль
# Обчислити середній бал
# Перевірити слово на паліндром
# Вийти
# Користувач обирає номер пункту, вводить необхідні дані, і програма виконує відповідну дію. Робота програми триває, поки користувач не обере пункт “4. Вийти”.
# Опис пунктів меню
# Перевірка пароля
# Користувач вводить пароль. Програма перевіряє, чи відповідає він вимогам:
# не менше 8 символів;
# містить велику та маленьку літеру;
# містить цифру;
# не має пробілів.
# Якщо всі умови виконані — вивести:
# Пароль надійний
# Інакше — повідомити, які саме умови порушено.
# Калькулятор середнього балу
# Користувач вводить оцінки через кому (наприклад: 12, 10, 9, 11). Програма:
# перетворює їх у числа,
# перевіряє, що всі оцінки від 1 до 12,
# обчислює середнє арифметичне,
# виводить середній бал та оцінку за шкалою:
# Середній бал Коментар 10–12 Відмінно! 7–9 Добре 4–6 Задовільно 1–3 Спробуйте ще 3. Перевірка слова на паліндром
# Користувач вводить слово. Програма:
# виводить його у зворотному порядку,
# підраховує кількість голосних і приголосних,
# визначає, чи є слово паліндромом (читається однаково зліва направо і справа наліво).
# Вимоги до програми
# Кожен пункт меню реалізувати у вигляді окремої функції.
# Головне меню має працювати у нескінченному циклі while.
# Використати умовні оператори, цикли, рядкові методи та арифметичні обчислення.
# Код має бути охайним, читабельним і містити коментарі.
# Приклад роботи програми === Помічник користувача ===
# Перевірити пароль
# Обчислити середній бал
# Перевірити слово на паліндром
# Вийти
# Оберіть пункт меню: 1 Введіть пароль: Python123 Пароль надійний
# Оберіть пункт меню: 2 Введіть оцінки через кому: 12,10,11 Середній бал: 11.0 Відмінно!
# Оберіть пункт меню: 3 Введіть слово: level Перевернуте слово: level Голосних: 2 Приголосних: 3 Це паліндром
# Оберіть пункт меню: 4 До побачення!
# Додаткове (за бажанням)
# Додайте підрахунок кількості виконаних дій за сесію.
# Збережіть результати у файл results.txt.
# Додайте опцію "5. Очистити екран".
print("=== Помічник користувача ===")
print("1. Перевірити пароль")
print("2. Обчислити середній бал")
print("3. Перевірити слово на паліндром")
print("4. Вийти")
# Функція яка викликає пункт меню 1 та обробляє данні
def punkt_1():
    password = input("Введіть пароль: ")
    if any(ch.islower() for ch in password) != True:
        result1 = "Ваш пароль не містить маленької літери"
    elif any(ch.isupper() for ch in password) != True:
        result1 = "Ваш пароль не містить великої літери"
    elif any(ch.isdigit() for ch in password) != True:
        result1 = "Ваш пароль не містить цифри"
    elif any(ch.isspace() for ch in password):
        result1 = "Ваш пароль містить пробіл"
    else:
        result1 = "Пароль надійний"
    return print("\n" + result1 + "\n")
# Функція яка викликає пункт меню 2 та обробляє данні
def punkt_2():
    grades = input("Введіть оцінки через кому: ")
    grades = "".join(grades.split()) # видаляє усі пробіли
    list_of_grades = grades.split(",") # робить список з цифр
    average = 0
    for i in list_of_grades:
        average += int(i)
    average /= len(list_of_grades)
    print(average)
    if 10 <= average <= 12:
        result2 = f"Середній бал: {average} Відмінно!"
    elif 7 <= average < 10:
        result2 = f"Середній бал: {average} Добре!" 
    elif 4 <= average < 7:
        result2 = f"Середній бал: {average} Задовільно!"
    else:
        result2 = "Спробуйте ще"
    return print("\n" + result2 + "\n")  
# Функція яка викликає пункт меню 3 та обробляє данні
def punkt_3():
    text = input("Введіть слово: ")
    text = text.lower()
    vowels = set("аеёиіоуыэюяaeiouy")
    consonants = set("бвгджзйклмнпрстфхцчшщbcdfghjklmnpqrstvwxyz")
    vowel_count = 0
    consonant_count = 0
    for char in text:
        if char in vowels:
            vowel_count += 1
        elif char in consonants:
            consonant_count += 1
    if text == text[::-1]:
        result3 = text[::-1] + f" Голосних: {vowel_count} Приголосних: {consonant_count} Це паліндром"
    else:
        result3 = text[::-1] + f" Голосних: {vowel_count} Приголосних: {consonant_count} Це не паліндром"
    return print("\n" + result3 + "\n")  
while True:
    punkt_menu = int(input("Оберіть пункт меню: "))
    match punkt_menu:
        case 1:
            punkt_1()
            continue
        case 2:
            punkt_2()
            continue
        case 3:
            punkt_3()
            continue
        case 4:
            break

