# # Tasks for lesson on the topic of "list() | tuple()"
# *Beginner level*
# 1. Створіть список на основі введеної послідовності цілих чисел і надрукуйте другу половину списку. Якщо кількість не парна, то вивести більшу кількість.
# lst1 = input("Enter data: ")
# lst1 = lst1.split()
# print(lst1[(len(lst1) // 2):])

# 2. Створіть список на основі введеної послідовності цілих чисел і надрукуйте його елементи таким чином: два останні елементи переміщені з кінця в початок списку без зміни їх початкового порядку.
# lst2 = input("Enter data: ")
# lst2 = lst2.split()
# lst22 = lst2[(len(lst2) - 2):]
# lst22.extend(lst2[: (len(lst2) - 2)]) 
# print(lst22)

# 3. Збережіть назви мов світу, які вводяться в одному рядку через пропуск, у списку. Простежте за тим, щоб елементи у списку не зберігались в алфавітному порядку. Відсортуйте список в алфавітному порядку і виведіть його елементи в рядку через пропуск.
str_lan = "Deutsch Englisch Ukrainian Serbian Danisch"
str_lan = str_lan.split()
str_lan.sort()
# print(" ".join(str_lan))

# 4. Виведіть елементи списку в зворотному порядку, не змінюючи сам список.
# print(str_lan[::-1])

# 5. Виведіть всі елементи списку з парними індексами. Вводиться список чисел. Всі числа списку знаходяться на одному рядку.
str_num = "11 21 15 11 154 11 24 88 85 47"
str_num = str_num.split()
# print(str_num[::2])

# 6. Визначте, скільки різних слів у введеному рядку.
#     Вхідні дані:
#     New Delhi New York Paris Prague Reykjavik
#     Happy New Year Happy New Year May we all have a vision now and then Of a world where every neighbor is a friend
#     Вихідні дані:
#     6
#     19
def count_dif_word(str_count):
    str_count = str_count.split()
    str_count = set(str_count)
    return len(str_count)
s1 = "New Delhi New York Paris Prague Reykjavik"
s2 = "Happy New Year Happy New Year May we all have a vision now and then Of a world where every neighbor is a friend"
# print(count_dif_word(s1), count_dif_word(s2))

# 7. Напишіть програму, яка приймає послідовність чисел, розділених комами, від користувача і створює список і кортеж з цими числами.
#     Вхідні дані:
#     7, 9, 12, 4
#     Вихідні дані:
#     [7, 9, 12, 4]
#     (7, 9, 12, 4)
str7 = "7, 9, 12, 4"
str7 = str7.split(", ")
# print(str7)
# print(tuple(str7))

# 8. Напишіть програму для отримання частини рядка URL, що позначає назву ресурсу.
#     Вхідні дані:
#     https://www.namesite.com/folder/index.html
#     Вихідні дані:
#     index.html
str8 = "https://www.namesite.com/folder/index.html"
str8 = str8.split("/")
# print(str8[-1])


# *Middle level*
# 9. Для введеної послідовності унікальних цілих чисел, поміняйте місцями мінімальний та максимальний елементи цієї послідовності. Надрукуйте отриманий список.
str9 = "3 22 15 13 57 24 35 77 61 40"
str9 = [int(num_str) for num_str in str9.split()]
str91 = str9.copy()
min9 = min(str9)
max9 = max(str9)
str91[str9.index(min9)] = max9
str91[str9.index(max9)] = min9
# print(str91)

# 10. Напишіть програму, яка приймає послідовність рядків (порожній рядок для завершення програми) як вхідний рядок і друкує рядки у верхньому регістрі.
#     Вхідні дані:
#     python
#     ruby
#     go
#     Вихідні дані:
#     PYTHON
#     RUBY
#     GO
# lst10 = []
# while True:
#     s = input("Enter text: ")
#     if s == "":
#         break
#     lst10.append(s.upper())
# for x in lst10:
#     print(x)

# 11. У введеному списку цілих чисел, знайдіть і надрукуйте сусідні елементи, які мають однаковий знак. Якщо такої пари немає, не повинно нічого виводитися.
#     Вхідні дані:
#     1 -2 -3 5 6 -3 7 8
#     Вихідні дані:
#     -2 -3
#     5 6
#     7 8
# str11 = "1 -2 -3 5 6 -3 7 8"
# str11 = list(map(int, str11.split()))
# for i in range(len(str11)-1):
#     if str11[i] * str11[i + 1] > 0:
#         print(str11[i], str11[i + 1])

# 12. Напишіть програму для обчислення добутку цілих чисел (без використання циклу for), які вводяться через пропуск користувачем в одному рядку.
#     Вхідні дані:
#     2 5 3
#     Вихідні дані:
#     30
str12 = "2 5 3"
str12 = list(map(int, str12.split()))
i = 0
mult = 1
while i < len(str12):
    mult *= str12[i]
    i += 1
# print(mult)

# 13. Напишіть програму для друку елементів певного цілочисельного списку після видалення з нього парних чисел. Значення списку вводяться через пропуск в одному рядку.
#     Вхідні дані:
#     3 44 6 8 9 12 7
#     Вихідні дані:
#     [3, 9, 7]
# str13 = "3 44 6 8 9 9 5 12 14 7"
# str13 = list(map(int, str13.split()))
# i, j = 0, 0
# while i < len(str13):
#     if str13[i] % 2 == 0:
#         str13.pop(i)
#     else:
#         i += 1    
# print(str13)

# 14. Напишіть програму, яка приймає послідовність 4-цифрових двійкових чисел, розділених комами, і друкує числа, які ділиться на 5 без остачі, в рядку і розділені комами.
#     Вхідні дані:
#     0100,0011,1010,1001,1100
#     Вихідні дані:
#     1010
# str14 = "0100,0011,1010,1001,1100"
# str14 = str14.split(",")
# str141 = []
# str142 = [] 
# for i in str14:
#     num = int(i[0]) * 8 + int(i[1]) * 4 + int(i[2]) * 2 + int(i[3]) * 1
#     str142.append(num)
#     if num % 5 == 0:
#         str141.append(i)
# print(str141)
# print(str142)

# 15. Ви вирішили написати перетворювач коду на Python в код на Java. Так як на Java прийнятий стандарт найменування CamelCase, то ви вирішили навчитися перетворювати імена з underscore в цей формат. Стиль underscore характеризується тим, що слова в імені пишуться маленькими літерами і розділяються між собою символом підкреслення _. Стиль CamelCase означає, що кожне слово пишеться з великої літери і роздільників між словами немає. Отже, вводиться один рядок, що містить ім’я, записане в форматі underscore. Програма виводить рядок, що містить ім’я в форматі CamelCase.
#     Вхідні дані:
#     my_class
#     c
#     Вихідні дані:
#     MyClass
#     C
# str15 = input("Enter code: \n")
# str15 = str15.split("_")
# str151 = ""
# for i in str15:
#     str151 += i.capitalize()
# print(str151)


# 16. Напишіть програму для видалення кожного третього елемента із цілочисельного списку і друку результуючого списку, доки список не стане порожнім. Початковий список цілих чисел вводиться в одному рядку через пропуск.
#     Вхідні дані:
#     2 5 8 9 4 78 7 1
#     Вихідні дані:
#     [2, 5, 9, 4, 78, 7, 1]
#     [2, 5, 4, 78, 7, 1]
#     [2, 5, 78, 7, 1]
#     [2, 5, 7, 1]
#     [2, 5, 1]
#     [2, 5]
#     [5]
#     []
# str16 = "2 5 8 9 4 78 7 1"
# str16 = list(map(int, str16.split()))
# while len(str16):
#     if len(str16) < 3:
#         str16.pop(len(str16)-1)
#     else:
#         str16.pop(2)
#     print(str16)

# 17. Користувач вводить два цілих додатних числа n і m. Напишіть програму, яка створює двовимірний масив розміром n x m і заповнює його символами . і * у шаховому порядку (як у вихідних даних). Лівий верхній кут повинен мати символ ..
#     Вхідні дані:
#     6 8
#     Вихідні дані:
#     . * . * . * . *
#     * . * . * . * .
#     . * . * . * . *
#     * . * . * . * .
#     . * . * . * . *
#     * . * . * . * .
# n = 6
# m = 8
# for i in range(n):
#     for j in range(m):
#         if (i + j) % 2 == 0:
#             print(". ", end="")
#         else:
#             print("* ", end="")
#     print()

# *Hard level*
# 18. У рядку через кому перераховані слова. Сформувати з цих слів новий рядок. Слова мають бути відсортовані за спаданням (від Z до A) без урахування регістру і записані через пропуск.
#     Вхідні дані:
#     horse, cat, parrot, goldfish, dog
#     Вихідні дані:
#     parrot horse goldfish dog cat
# str18 = "horse, cat, parrot, Goldfish, dog"
# str18= str18.split(", ")
# str18.sort(key=str.lower, reverse=True)
# print(" ".join(str18))


# 19. Напишіть програму, яка виводить частину послідовності `1 2 2 3 3 3 4 4 4 4 5 5 5 5 5...` (число повторюється стільки разів, чому дорівнює). На вхід програми передається невід’ємне ціле число `n` - стільки елементів послідовності повинна надрукувати програма. На виході очікується послідовність чисел, записаних через пропуск в один рядок.
#     Вхідні дані:
#     8
#     Вихідні дані:
#     1 2 2 3 3 3 4 4
def task19():
    num19 = int(input("Enter number: "))
    i = 0
    j = 1
    res = []
    while i < num19:
        for k in range(j):
            res.append(j)
        i += j
        j += 1
    print(*res[:num19])    


# 20. Використовуючи поняття списку, напишіть програму, яка створює 3D масив елементів a x b x c, кожен з яких має значення 0. Значення a, b, c вводяться в одному рядку через пропуск.
# Вхідні дані:
# 3 3 2
# 4 4 4
# Вихідні дані:
# [[[0, 0], [0, 0], [0, 0]], [[0, 0], [0, 0], [0, 0]], [[0, 0], [0, 0], [0, 0]]]
# [[[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]], [[0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0], [0, 0, 0, 0]]]
# -----------------------------------------------
a, b, c = 3, 3, 2
lst_a = []
for i in range(a):
    lst_b = []
    for j in range(b):
        lst_c = []
        for k in range(c):
            lst_c.append(0)
        lst_b.append(lst_c)
    lst_a.append(lst_b)
# print(lst_a)



# 21. В один ряд поставили `n` кеглів, пронумерувавши їх зліва направо числами від `1` до `n`. Потім в цей ряд кинули `k` куль, при цьому `i`-та куля збила всі кеглі з номерами від `m` до `h` включно. Визначте, які кеглі залишилися стояти на місці. Програма отримує на вхід кількість кеглів `n` і кількість кидків `k`. Далі йде `k` пар чисел `m`, `h`, при цьому `1 ≤ m ≤ h ≤ n ≤ 100`. Програма повинна вивести послідовність з `n` символів, де `j`-й символ є `I`, якщо `j`-та кегля залишилася стояти, або `.`, якщо `j`-та кегля була збита.
#     Вхідні дані:
#     10 3
#     8 10
#     2 5
#     3 6
#     Вихідні дані:
#     I.....I...
def task21():
    str21 = input("Enter data: \n")
    str21 = list(map(int, str21.split()))
    n = str21[0]
    k = str21[1]
    result21 = "I" * n
    for i in range(k):
        str_res = input("")
        str_res = list(map(int, str_res.split()))
        result21 = result21[0: str_res[0] - 1] + "*" * (str_res[1] - str_res[0] +1) + result21[str_res[1]:]
    print(result21)  

# 485. Суть завдання та ж, що і у задачі Шифр Цезаря, з однією відмінністю:
# кодуються символи з інтервалу 1F600-1F64F таблиці символів Unicode . 
# Використовується кодування UTF-8 . Для всіх символів зсув один і той же. Зсув 
# циклічний, тобто, якщо до останнього символу алфавіту застосувати одиничний
# зсув, то він заміниться на перший символ, і навпаки. Напишіть програму, яка 
# шифрує текст шифром Цезаря. На першому рядку вказується використовуваний зсув 
# шифрування: ціле число. Додатне число відповідає зсуву вправо. На другому 
# рядку вказується непорожня фраза для шифрування. Не звертайте уваги, якщо у 
# вас відображаються прямокутники замість деяких символів. Це означає, що ваш 
# шрифт не містить цих символів. Програма має вивести єдиний рядок, в якій
# записана зашифрована послідовність.
#  Вхідні дані:
#  2
#  😍😎😏
#  Вихідні дані:
#  😏😐😑
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
start_char = int("1F600", 16)
end_char = int("1F64F", 16)
code_num = int(input("Enter number for code: \n"))
symbols = list(map(ord, list(input("and symbols: \n"))))
res = []
for ch in symbols:
    if start_char <= ch <= end_char:
        if ch + code_num >= end_char:
            res.append(chr(start_char + ch + code_num - end_char + 1))
        elif ch + code_num >= start_char:
            res.append(chr(end_char - ch - code_num - start_char - 1))
        else:
            res.append(chr(ch + code_num))
    else:
        print(" not correct symbol")
        break
print("Result is: ", "".join(res))


#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
#  487. Напишіть програму, на вхід якої подається список чисел одним рядком. 
#  Програма повинна для кожного елемента цього списку вивести суму двох його
#  сусідів. Для елементів списку, які є крайніми, одним із сусідів вважається
#  елемент, що знаходить на протилежному кінці цього списку. Якщо на вхід 
#  прийшло тільки одне число, треба вивести його ж. Виведення повинно містити
#  один рядок з числами нового списку, розділеними пропусками.
# Вхідні дані:
#  1 3 5 6 10
#  5
#  Вихідні дані:
#  13 6 9 15 7
#  5
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
# lst487 = input("Enter data: \n")
# lst487 = list(map(int, lst487.split()))
# res = []
# for i in range(len(lst487)):
#     if len(lst487) > 1:
#         res.append(str(lst487[i - 1] + lst487[(i + 1) % len(lst487)]))
#     else:
#         res.append(str(lst487[i]))
# print(" ".join(res))

#  488. Вводиться рядок, що складається із слів, розділених пропусками.
#  Потрібно впорядкувати слова в рядку так, щоб найбільш короткі з них були
#  спочатку рядка, а найбільш довгі в кінці. Слова необхідно вивести на екран 
#  через кому і пропуск, а рядок впорядкованих слів має закінчуватися крапкою.
#  Вхідні дані:
#  ab aaab ba baaaaa a aba
#  Вихідні дані:
#  a, ab, ba, aba, aaab, baaaaa.
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
# lst488 = input("Enter data: \n")
# lst488 = lst488.split()
# l1, l2 = [], []
# for i in range(len(lst488)):
#     l1.append(i)
#     l2.append(len(lst488[i]))
# res = []
# while l1:
#     index_temp = l2.index(min(l2))
#     res.append(lst488[l1[index_temp]])
#     l1.pop(index_temp)
#     l2.pop(index_temp)
# res = ", ".join(res) + "."
# print(res) 

#  489. Вводяться n рядків. Визначити найдовший рядок і вивести його номер на 
#  екран. Якщо найдовших рядків кілька, то вивести номери всіх таких рядків.
#  Вхідні дані:
#  5
#  Thames
#  Amazon
#  Nile
#  Yangtze
#  Dnieper
#  Вихідні дані:
#  4
#  5
# Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
# lst489 = []
# len_lst = []
# print("Enter data: ")
# while True:
#     tmp = input()
#     if tmp != "":
#         lst489.append(tmp)
#         len_lst.append(len(tmp))
#     else:
#         break
# max_len = max(len_lst)
# for i, l in enumerate(len_lst, start=1):
#     if l == max_len:
#         print(i)
# 

def task489():
    lst489 = [input() for _ in range(int(input("Enter number of lines: ")))]
    max_len = max(len(s) for s in lst489)
    print(*[i+1 for i, s in enumerate(lst489) if len(s) == max_len], sep="\n")



#  490. Дано список з n (1 ≤ n ≤ 100000) цілих чисел і число k (|k| < 100000 ). Циклічно посуньте список
#  на |k| елементів вправо, якщо k - додатне і вліво, якщо від’ємне число. Програма отримує на вхід
#  список цілих чисел, потім число k . Рішення повинно мати складність O(n) , тобто не повинно
#  залежати від k. Додатковим списком користуватися не можна.
#  Вхідні дані:
#  5 3 7 4 6
#  3
#  7 4 6 5 3
# -3
#  Вихідні дані:
#  7 4 6 5 3
#  5 3 7 4 6
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task490():
    lst490 = "7 4 6 5 3".split()
    step = -3
    n = len(lst490)
    step %= n 
    lst490[:] = lst490[-step:] + lst490[:-step]
    print(*lst490)




#  491. Користувач вводить ціле число n і видаляє одну цифру числа так, щоб
#  число що утворилось, було максимально можливим. Наприклад, якщо число, яке 
#  ввели 432, то необхідно видалити цифру 2, яка стоїть на 3 місці, щоб 
#  oтримати максимально можливе число 43. Напишіть програму, яка знайде 
#  максимально можливе число, яке можна отримати після видалення однієї цифри.
#  Вхідні дані:
#  432
#  239
#  101
#  Вихідні дані:
#  43
#  39
#  11
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task491():
    num = list(input())
    nums = []
    for i in range(len(num)):
        nums.append(int("".join(num[:i] + num[i + 1:])))
    print(max(nums))


#  492. Вводиться рядок слів, розділених пропусками. Знайти найдовше слово і вивести його на екран.
#  Розглянути випадок, коли найдовших неоднакових слів може бути кілька.
#  Вхідні дані:
# Sparse is better than dense
#  Readability counts
#  Long time Pythoneer Tim Peters succinctly channels the BDFL's guiding principles for Python's design into 
# 20 aphorisms
#  Вихідні дані:
#  Sparse better
#  Readability
#  succinctly principles
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task492():
    str1 = "Long time Pythoneer Tim Peters succinctly channels the BDFL's guiding principles for Python's design into 20 aphorisms".split()
    max_len = max(len(word) for word in str1)
    longest_words = [word for word in str1 if len(word) == max_len]
    print(*longest_words)

#  493. В один ряд поставили n кеглів, пронумерувавши їх зліва направо числами 
#  від 1 до n. Потім в цей ряд кинули k куль, при цьому i-та куля збила всі 
#  кеглі з номерами від m до h включно. Визначте, які кеглі залишилися стояти 
#  на місці. Програма отримує на вхід кількість кеглів n і кількість кидків
#  k . Далі йде k пар чисел m, h, при цьому 1 ≤ m ≤ h ≤ n ≤ 100. Програма 
#  повинна вивести послідовність з n символів, де j-й символ є I, якщо j-та 
#  кегля залишилася стояти, або ., якщо j та кегля була збита.
#  Вхідні дані:
#  10 3
#  8 10
#  2 5
#  3 6
#  Вихідні дані:
#  I.....I...
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task493():
    str21 = input("Enter data: \n")
    str21 = list(map(int, str21.split()))
    n = str21[0]
    k = str21[1]
    result21 = "I" * n
    for i in range(k):
        str21 = input("")
        str21 = list(map(int, str21.split()))
        result21 = result21[0: str21[0] - 1] + "*" * (str21[1] - str21[0] +1) + result21[str21[1]:]
    print(result21)  


#  494. Дано список цілих чисел. Потрібно стиснути його, перемістивши всі
#  ненульові елементи в ліву частину списку, не змінюючи їх порядок, а всі нулі 
# - в праву частину. Порядок ненульових елементів змінювати не можна, 
#  додатковий список використовувати не можна, завдання потрібно виконати за
#  один прохід по списку. Роздрукуйте отриманий список.
#  Вхідні дані:
#  6 0 3 0 5 0 0 4
#  Вихідні дані:
#  6 3 5 4 0 0 0 0
# Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task494():
    lst1 = list(map(int, "6 0 3 0 5 0 0 4".split()))
    itr = 0
    for i in range(len(lst1)):
        if lst1[i] != 0:
            lst1[itr], lst1[i] = lst1[i], lst1[itr]
            itr += 1
    print(*lst1)


#  495. Вводиться рядок, який може мати пропуски на початку, між словами і у 
#  кінці. Пропусків може бути більше одного. Необхідно привести рядок до 
#  нормального вигляду, тобто видалити усі пропуски, а між словами залишити 
#  тільки один пропуск.
#  Вхідні дані:
#       The  Zen  of      Python
# Вихідні дані:
# The Zen of Python
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task495():
    str1 = "     The  Zen  of      Python"
    print(" ".join(str1.split()))


#  496. Напишіть програму, яка приймає на вхід список чисел і число (в окремих 
#  рядках), після чого виводить всі позиції через пропуск, на яких це число 
#  зустрічається в переданому списку (позиції у списку нумеруються з 1). 
#  Позиції повинні бути виведені в порядку зростання. Якщо число не знайдено в
#  списку, потрібно вивести рядок None (без лапок, з великої літери).
#  Вхідні дані:
#  5 7 3 4 9 8 4 7 4
#  4
#  Вихідні дані:
#  4 7 9
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task496():
    lst1 = list(map(int, "5 7 3 4 9 8 4 7 4".split()))
    num = 4
    res = [i + 1 for i, el in enumerate(lst1) if el == num]
    if res:
        print(*res)
    else:
        print("None")


#  497. Напишіть програму, яка знаходить усі позиції входження підрядка B у 
#  рядок A . На першому рядку міститься вхідний рядок, на другому рядку 
#  введення вказаний підрядок, позиції якого потрібно знайти. Рядки складаються 
#  з символів англійського алфавіту. Програма має вивести позиції входження 
#  підрядка B у рядок A (індексація починається з 1), розділені пропуском або 
#  число -1 в разі, коли підрядок не знайдено.
#  Вхідні дані:
#  abacabadaba
#  aba
#  abc
#  d
#  Вихідні дані:
#  0 4 8-1
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task497():
    A = input().strip()
    B = input().strip()
    positions = []
    for i in range(len(A) - len(B) + 1):
        if A[i:i+len(B)] == B:
            positions.append(i + 1)
    if positions:
        print(*positions)
    else:
        print(-1)


#  498. Кодування довжин послідовностей - це базовий алгоритм стиснення даних.
#  Реалізуйте алгоритм дешифрування (декодування) рядків, закодованих за 
#  допомогою одного з найпростіших варіантів кодування довжин послідовностей. 
#  На вхід алгоритму подається рядок, що містить цифри і символи англійського 
#  алфавіту. Цей рядок розбивається на так звані серії (послідовності), які 
#  кодуються парою число-символ або просто символ (в такому випадку число 
#  вважається рівним одиниці). Результат повинен містити ці серії в тому ж 
#  порядку, що вони і зустрічаються в заданому рядку, при цьому кожна серія 
#  розгортається в послідовність символів відповідної довжини. Наприклад, 
#  закодований рядок 3ab4c2CaB розбивається на серії 3a b 4c 2C a B , після 
#  чого, перетворюючи серії, отримуємо початковий розкодований рядок 
#  aaabccccCCaB .
#  Вхідні дані:
#  3ab4c2CaB
#  10a3b2c4DFj5h
#  Вихідні дані:
#  aaabccccCCaB
#  aaaaaaaaaabbbccDDDDFjhhhhh
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task498():
    lst1 = "3ab4c2Ca10B"
    ch = ""
    res = ""
    for i in lst1:
        if i.isdigit():
            ch += i
        else:
            count = int(ch) if ch else 1
            res += i * count
            ch = ""
    print(res)

#  499. Напишіть програму, яка отримує на вхід чотирьохзначне додатне десяткове 
#  число та генерує з цифр цього числа мінімально можливе чотирьохзначне число 
#  та максимально можливе чотирьохзначне число. У першому рядку задано одне 
#  чотирьохзначне число. Виведіть у другому рядку два числа найменше 
#  чотирьохзначне число та найбільше чотирьохзначне число, які можна отримати з 
#  цифр даного числа. Числа розділяйте одним пропуском.
#  Вхідні дані:
#  1390
#  1010
#  5173
# Вихідні дані:
#  1039 9310
#  1001 1100
#  1357 7531
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task499():
    s = input().strip()
    d = sorted(s)
    if d[0] == '0':
        for i in range(1, 4):
            if d[i] != '0':
                d[0], d[i] = d[i], d[0]
                break
    print("".join(d), "".join(sorted(s, reverse=True)))



#  500. Вводиться послідовність цілих чисел у вигляді як у вхідних даних і 
#  перетвоюється у список списків, тобто у список, кожен елемент якого також є 
#  списком. Впорядкуйте цей список по другому елементу кожного списку і 
#  виведіть впорядкований список.
#  Вхідні дані:
#  1 2 3,2 1 3,4 0 1
#  Вихідні дані:
#  [[1, 2, 3], [2, 1, 3], [4, 0, 1]]
#  [[4, 0, 1], [2, 1, 3], [1, 2, 3]]
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task500():
    s = "1 2 3,2 1 3,4 0 1"
    lst = [list(map(int, part.split())) for part in s.split(",")]
    print(lst)
    lst_sorted = sorted(lst, key=lambda x: x[1])
    print(lst_sorted)


#  501. У трьох автобусах розсадили дітей так, що їх кількість в різних 
#  автобусах різна. Яку найменшу кількість дітей потрібно пересадити, щоб у 
#  кожному автобусі їх було порівно? У першому рядку задано три натуральних 
#  числа, не більших за 100 - кількість дітей у першому, другому та третьому
#  автобусах. Виведіть одне число - найменшу кількість дітей, яких потрібно 
#  пересадити. Якщо це зробити не можливо, то виведіть NO SOLUTIONS .
#  Вхідні дані:
#  9 10 10
#  2 5 8
#  Вихідні дані:
#  NO SOLUTIONS
#  3
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task501():
    lst = list(map(int, "2 5 8".split()))
    sum_kids = sum(lst)
    if sum_kids % 3 != 0:
        print("NO SOLUTIONS")
    else:
        total = sum(max(0, k - sum_kids // 3) for k in lst)
        print(total)


# 502. Напишіть програму, яка знайде максимально можливе число, яке можна 
#  отримати після видалення однієї цифри. Перший рядок містить одне ціле число 
#  n (10 ≤ n ≤ 2025). Виведіть у другому рядку максимально можливе число, яке 
#  можна отримати після видалення однієї цифри.
#  Вхідні дані:
#  4378
#  1095
#  2000
#  Вихідні дані:
#  478
#  195
#  200
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
def task502():
    num = list(input())
    nums = []
    for i in range(len(num)):
        nums.append(int("".join(num[:i] + num[i + 1:])))
    print(max(nums))
# task502()


#  503. У римській системі числення для позначення чисел використовуються 
#  наступні символи (праворуч записані числа, яким вони відповідають в 
#  десятковій системі числення):
#  I = 1
#  V = 5
#  X = 10
#  L = 50
#  C = 100
#  D = 500
#  M = 1000
#  Будемо використовувати варіант, в якому числа 4, 9, 40, 90, 400 і 900 
#  записуються як віднімання з більшого числа меншого: IV, IX, XL, XC, CD і CM, 
#  відповідно. Напишіть програму, яка переводить число з римської в десяткову 
#  систему числення. Користувач вводить рядок, що містить число, закодоване в 
#  римській системі числення. Гарантується, що число менше 4000. Програма має 
#  вивести рядок, що містить число в десятковій системі числення, відповідне 
#  введеному.
#  Вхідні дані:
#  MCMLXXXI
#  XXI
#  IV
#  Вихідні дані:
#  1981
#  21
#  4
def roman_num(num):
    num = num[::-1]
    num_dict = {'I': 1, 'V': 5, 'X': 10, 'L': 50, 'C': 100, 'D': 500, 'M': 1000}
    non_repeatable = {'V', 'L', 'D'}   
    res = num_dict[num[0]]
    count_rep = 0
    for i in range(1, len(num)):
        if (count_rep > 0 and num[i] in non_repeatable) or \
            (num_dict.get(num[i]) == None) or \
            (num[i - 1] == num[i] and count_rep > 3) or \
            (num[i-1] == 'I' and num[i] not in ('V','X')) or \
            (num[i-1] == 'X' and num[i] not in ('L','C')) or \
            (num[i-1] == 'C' and num[i] not in ('D','M')) or \
            (num[i-1] in ('V','L','D')):
            return "Invalid number"
        elif num[i - 1] == num[i]:
            count_rep +=1
        else:
            count_rep =0
        if num_dict[num[i]] < num_dict[num[i - 1]]:
            res -= num_dict[num[i]]
        else:
            res += num_dict[num[i]]
    return res
# rom_num = input("Enter roman number(num <= 4000): ")
# print(roman_num(rom_num))



# Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ
#  504. Анаграма - переставлення літер у слові, завдяки чому утворюється нове значення слова. Напишіть
#  програму, яка перевіряє, чи є два введених слова анаграмами. Програма повинна вивести True в
#  разі, якщо введені слова є анаграмами, і False в інших випадках. Слово може складатися тільки з
#  англійських символів. Регістр букв не повинен впливати на відповідь.
#  Вхідні дані:
#  restful
#  fluster
#  forty-five
#  over-fifty
#  anagram
#  naganra
#  Вихідні дані:
#  True
#  True
#  False
#  Розділ: СПИСКИ І КОРТЕЖІ | Рівень складності: ВИСОКИЙ




#  505. Магічний квадрат - це квадратна таблиця n x n, заповнена цілими числами 
#  таким чином, що сума чисел у кожному рядку, кожному стовпчику і на обох 
#  діагоналях однакова. Напишіть програму, яка отримує послідовність чисел у 
#  форматі як у вхідних даних, з яких утворюється двовимірна таблиця (список 
#  списків) цілочисельних елементів і перевірте чи є вона магічним квадратом. 
#  Програма має вивести True чи False відповідно.
#  Вхідні дані:
#  1 2 3,4 5 6,7 8 9
#  4 9 2,3 5 7,8 1 6
#  7 12 1 14,2 13 8 11,16 3 10 5,9 6 15 4
#  23 28 21,22 24 26,27 20 25
#  16 23 17,78 32 21,17 16 15
#  4 3 8,9 5 1,2 7 6
#  Вихідні дані:
#  False
#  True
#  True
#  True
#  False
#  True